In [2]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\manju\anaconda3\lib\site-packages (1.26.4)

In [3]:
import numpy as np

In [4]:
list1 = [2,3,1,4,5]

In [5]:
np1 = np.array(list1)

In [6]:
type(np1)

numpy.ndarray

In [7]:
np.shape(np1)

(5,)

In [8]:
np1.itemsize

4

In [9]:
np2 = np.array([("manju", 37, 1),("mmm", 37, 1),("sdvcv", 37, 3),("masadanju", 37, 6),("asds", 37, 4)])
np2.ndim

2

In [10]:
np2.shape

(5, 3)

In [11]:
np2

array([['manju', '37', '1'],
       ['mmm', '37', '1'],
       ['sdvcv', '37', '3'],
       ['masadanju', '37', '6'],
       ['asds', '37', '4']], dtype='<U11')

In [12]:
np2[1,:]

array(['mmm', '37', '1'], dtype='<U11')

In [13]:
np2[1][1]

'37'

In [14]:
np2[1:3][1:3]

array([['sdvcv', '37', '3']], dtype='<U11')

In [15]:
np2.shape

(5, 3)

In [16]:
np1

array([2, 3, 1, 4, 5])

In [17]:
np1>2

array([False,  True, False,  True,  True])

In [18]:
np3 = np.array([1,2,3])
np4 = np.array([1,2,3])
np3 % np4

array([0, 0, 0])

In [19]:
np3.sum()

6

In [20]:
np5 = np.array([(1,2,3),(2,2,3),(4,3,3)])

In [21]:
np5.sum()

23

In [22]:
np.power(np5, 2)

array([[ 1,  4,  9],
       [ 4,  4,  9],
       [16,  9,  9]], dtype=int32)

In [23]:
np.concatenate([np3,np4])

array([1, 2, 3, 1, 2, 3])

In [24]:
np.stack([np3,np4], axis = 1)

array([[1, 1],
       [2, 2],
       [3, 3]])

In [25]:
np.hstack([np3,np4])

array([1, 2, 3, 1, 2, 3])

In [26]:
np.vstack([np3,np4])

array([[1, 2, 3],
       [1, 2, 3]])

In [27]:
np6 = np.dstack([np3,np4])

In [28]:
np6.ndim

3

In [29]:
np7 = np.arange(10)
np7

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [30]:
np.array_split(np7, 3)

[array([0, 1, 2, 3]), array([4, 5, 6]), array([7, 8, 9])]

In [31]:
np.hsplit(np7, 2)

[array([0, 1, 2, 3, 4]), array([5, 6, 7, 8, 9])]

In [32]:
np5

array([[1, 2, 3],
       [2, 2, 3],
       [4, 3, 3]])

In [33]:
for i in np5 :
    print(i+5)

[6 7 8]
[7 7 8]
[9 8 8]

In [34]:
np8 = np.arange(1,13).reshape(2,2,3)
np8

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 7,  8,  9],
        [10, 11, 12]]])

In [35]:
for i in np5 :
    for j in i :
        print(j+5)

6
7
8
7
7
8
9
8
8

In [36]:
for i in np.nditer(np5, op_flags = ['readwrite']) :
    i[...] = i**2

In [37]:
np5

array([[ 1,  4,  9],
       [ 4,  4,  9],
       [16,  9,  9]])

In [38]:
import pandas as pd

In [39]:
list1 = [2,3,1,4,5]
sr1 = pd.Series(list1)

In [40]:
sr1

0    2
1    3
2    1
3    4
4    5
dtype: int64

In [41]:
sr1[2]

1

In [42]:
sr1.rank()

0    2.0
1    3.0
2    1.0
3    4.0
4    5.0
dtype: float64

In [43]:
sr1.sort_values(ascending = False)

4    5
3    4
1    3
0    2
2    1
dtype: int64

In [44]:
dict1 = {
    "name" : ["manju"],
    "age" : ["37"],
    "designation" : ["se"]
}
sr2 = pd.Series(dict1)
sr2.rank()

name           2.0
age            1.0
designation    3.0
dtype: float64

In [45]:
df1 = pd.DataFrame(dict1)

In [46]:
df1

    name age designation
0  manju  37          se

In [47]:
df1.rank()

   name  age  designation
0   1.0  1.0          1.0

In [48]:
df2 = pd.read_csv("lds0.csv")

In [49]:
df2

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [50]:
df3 = df2.iloc[::3]

In [51]:
df3 = df3[["Rev", "StockID"]]

In [52]:
df3

   Rev  StockID
0  931        1
3  900        0
6  966        1
9  945        1

In [53]:
df3.unstack()

Rev      0    931
         3    900
         6    966
         9    945
StockID  0      1
         3      0
         6      1
         9      1
dtype: int64

In [54]:
np8 = np.arange(12).reshape((4,3))

In [55]:
idx = [["Class Test", "Class Test", "Sem Exam", "Sem Exam"],[1,2,1,2]]

In [56]:
colmns = [['Aria', 'Aria', 'John'],["Maths", "English", "Maths"]]

In [57]:
df4 = pd.DataFrame(np8, index = idx, columns = colmns)

In [58]:
df4

              Aria          John
             Maths English Maths
Class Test 1     0       1     2
           2     3       4     5
Sem Exam   1     6       7     8
           2     9      10    11

In [59]:
df4.stack()

C:\Users\manju\AppData\Local\Temp\ipykernel_16392\810993247.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df4.stack()

                      Aria  John
Class Test 1 English     1   NaN
             Maths       0   2.0
           2 English     4   NaN
             Maths       3   5.0
Sem Exam   1 English     7   NaN
             Maths       6   8.0
           2 English    10   NaN
             Maths       9  11.0

In [60]:
df4.unstack()

            Aria                 John
           Maths    English     Maths
               1  2       1   2     1   2
Class Test     0  3       1   4     2   5
Sem Exam       6  9       7  10     8  11

In [61]:
df4

              Aria          John
             Maths English Maths
Class Test 1     0       1     2
           2     3       4     5
Sem Exam   1     6       7     8
           2     9      10    11

In [62]:
df4.index.names = ['key1', 'key2']

In [63]:
df4

                 Aria          John
                Maths English Maths
key1       key2
Class Test 1        0       1     2
           2        3       4     5
Sem Exam   1        6       7     8
           2        9      10    11

In [64]:
df4.columns.names = ['names', 'subject']

In [65]:
df4

names            Aria          John
subject         Maths English Maths
key1       key2
Class Test 1        0       1     2
           2        3       4     5
Sem Exam   1        6       7     8
           2        9      10    11

In [66]:
df4.stack()

C:\Users\manju\AppData\Local\Temp\ipykernel_16392\810993247.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df4.stack()

names                    Aria  John
key1       key2 subject
Class Test 1    English     1   NaN
                Maths       0   2.0
           2    English     4   NaN
                Maths       3   5.0
Sem Exam   1    English     7   NaN
                Maths       6   8.0
           2    English    10   NaN
                Maths       9  11.0

In [67]:
df4.unstack()

names       Aria                 John
subject    Maths    English     Maths
key2           1  2       1   2     1   2
key1
Class Test     0  3       1   4     2   5
Sem Exam       6  9       7  10     8  11

In [68]:
df4.stack()

C:\Users\manju\AppData\Local\Temp\ipykernel_16392\810993247.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df4.stack()

names                    Aria  John
key1       key2 subject
Class Test 1    English     1   NaN
                Maths       0   2.0
           2    English     4   NaN
                Maths       3   5.0
Sem Exam   1    English     7   NaN
                Maths       6   8.0
           2    English    10   NaN
                Maths       9  11.0

In [69]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [90, 80, 85],
    'Science': [85, 89, 92]
})
df

      Name  Math  Science
0    Alice    90       85
1      Bob    80       89
2  Charlie    85       92

In [70]:
df_melted = pd.melt(df, id_vars=['Name'], var_name='Subject', value_name='Marks')

In [71]:
df_melted

      Name  Subject  Marks
0    Alice     Math     90
1      Bob     Math     80
2  Charlie     Math     85
3    Alice  Science     85
4      Bob  Science     89
5  Charlie  Science     92

In [72]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science'],
    'Marks': [90, 80, 85, 85, 89, 92]
})
df

      Name  Subject  Marks
0    Alice     Math     90
1      Bob     Math     80
2  Charlie     Math     85
3    Alice  Science     85
4      Bob  Science     89
5  Charlie  Science     92

In [73]:
pivot_df = pd.pivot_table(df, values='Marks', index='Name', columns='Subject', aggfunc='mean')

In [74]:
pivot_df

Subject  Math  Science
Name
Alice    90.0     85.0
Bob      80.0     89.0
Charlie  85.0     92.0

In [75]:
pd.pivot_table(df_melted, values='Marks', index='Name', columns='Subject', aggfunc='mean')

Subject  Math  Science
Name
Alice    90.0     85.0
Bob      80.0     89.0
Charlie  85.0     92.0

In [76]:
df3

   Rev  StockID
0  931        1
3  900        0
6  966        1
9  945        1

In [77]:
ss_dic = {
    0 : "Inactive",
    1 : "Active"
}
ss_dic

{0: 'Inactive', 1: 'Active'}

In [78]:
df3['Stock Status'] = df3["StockID"].map(ss_dic)
df3

   Rev  StockID Stock Status
0  931        1       Active
3  900        0     Inactive
6  966        1       Active
9  945        1       Active

In [79]:
df3

   Rev  StockID Stock Status
0  931        1       Active
3  900        0     Inactive
6  966        1       Active
9  945        1       Active

In [80]:
df3

   Rev  StockID Stock Status
0  931        1       Active
3  900        0     Inactive
6  966        1       Active
9  945        1       Active

In [251]:
replacerData = {
    "Inactive" : "Mute"
}
df3['Stock Status'].replace(replacerData, inplace = True)

C:\Users\manju\AppData\Local\Temp\ipykernel_16392\1671294559.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df3['Stock Status'].replace(replacerData, inplace = True)

In [253]:
df3

   Rev  StockID Stock Status
0  931        1       Active
3  900        0         Mute
6  966        1       Active
9  945        1       Active

In [255]:
df2

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [287]:
df2.groupby(["MNC", "Started"])["Rev"].sum().to_frame().reset_index()

   MNC   Started   Rev
0  Blr     Goods   966
1  Blr  Services   900
2  Che     Goods  1958
3  Hyd  Services   931
4  Kol     Goods   925
5  Mum  Services   899
6  NCR  Services  2839